Solution for the problems:

1. Select specific columns
2. fillter rows
3. ombine multiple columns

1 - square brackets
2 - boolean conditions

selecting columns

1- a series
2- dataframes multiple columns of data

column = df = ["Column_name",column2_name]  for accessing column

filttering rows 

boolean indexing

Filttering row based on single condition:

filltered_rows =df [df ["Column_name"] > 50000]

for multiple conditions:

filltered_row = df[(df["Salary"]> 50000) & (df["Salary"] < 80000)]

---

## ✅ 1. Selecting Specific Columns

* **Single column → Series**

```python
# Returns a Series
df["Name"]
```

* **Multiple columns → DataFrame**

```python
# Returns a DataFrame
df[["Name", "Salary"]]
```

---

## ✅ 2. Filtering Rows (Boolean Indexing)

* **Single condition**

```python
# Employees with Salary > 50000
filtered_rows = df[df["Salary"] > 50000]
```

* **Multiple conditions**

```python
# Employees with Salary > 50000 AND Salary < 80000
filtered_rows = df[(df["Salary"] > 50000) & (df["Salary"] < 80000)]

# OR condition (|)
filtered_rows = df[(df["Age"] < 30) | (df["Performance"] == "Excellent")]
```

---

## ✅ 3. Combining Multiple Columns

You can create a **new column** by combining others:

```python
# Example: Create a column with Name and Performance together
df["Summary"] = df["Name"] + " - " + df["Performance"]

# Example: Salary after Bonus (10%)
df["Salary_with_Bonus"] = df["Salary"] + (df["Salary"] * 0.10)
```

---

⚡ **Summary:**

* `df["col"]` → single column (Series)
* `df[["col1","col2"]]` → multiple columns (DataFrame)
* `df[condition]` → filter rows
* `df["new_col"] = ...` → create/modify columns

---

In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Amit", "Sita", "Raj", "Priya", "Vikram", "Anjali", "Rohan", "Kiran", "Meera"],
    "Age": [25, 30, 28, 35, 40, 29, 32, 26, 31],
    "Salary": [50000, 60000, 55000, 75000, 80000, 52000, 70000, 48000, 65000],
    "Performance": ["Good", "Excellent", "Average", "Excellent", "Good", "Average", "Good", "Poor", "Excellent"]
}

In [3]:
df  = pd.DataFrame(data)

In [4]:
print("Sample Dataframe :")

Sample Dataframe :

In [5]:
df

     Name  Age  Salary Performance
0    Amit   25   50000        Good
1    Sita   30   60000   Excellent
2     Raj   28   55000     Average
3   Priya   35   75000   Excellent
4  Vikram   40   80000        Good
5  Anjali   29   52000     Average
6   Rohan   32   70000        Good
7   Kiran   26   48000        Poor
8   Meera   31   65000   Excellent

In [6]:
print("Single column(Will return a series) : ")

Single column(Will return a series) :

In [7]:
df["Name"]

0      Amit
1      Sita
2       Raj
3     Priya
4    Vikram
5    Anjali
6     Rohan
7     Kiran
8     Meera
Name: Name, dtype: object

In [10]:
df[["Name", "Performance"]]

     Name Performance
0    Amit        Good
1    Sita   Excellent
2     Raj     Average
3   Priya   Excellent
4  Vikram        Good
5  Anjali     Average
6   Rohan        Good
7   Kiran        Poor
8   Meera   Excellent

Now for filltering rows:

In [11]:
df[df["Salary"]> 50000]

     Name  Age  Salary Performance
1    Sita   30   60000   Excellent
2     Raj   28   55000     Average
3   Priya   35   75000   Excellent
4  Vikram   40   80000        Good
5  Anjali   29   52000     Average
6   Rohan   32   70000        Good
8   Meera   31   65000   Excellent

In [13]:
df[(df["Salary"]> 50000) & (df["Salary"]<70000)]

     Name  Age  Salary Performance
1    Sita   30   60000   Excellent
2     Raj   28   55000     Average
5  Anjali   29   52000     Average
8   Meera   31   65000   Excellent

In [14]:
df[df["Performance"]=="Good"]

     Name  Age  Salary Performance
0    Amit   25   50000        Good
4  Vikram   40   80000        Good
6   Rohan   32   70000        Good

In [15]:
df[(df["Performance"]=="Good") |(df["Performance"] == "Excellent") ]

     Name  Age  Salary Performance
0    Amit   25   50000        Good
1    Sita   30   60000   Excellent
3   Priya   35   75000   Excellent
4  Vikram   40   80000        Good
6   Rohan   32   70000        Good
8   Meera   31   65000   Excellent

Now combining rows:

In [16]:
df["Summary"] = df["Name"] + " - " + df["Performance"]

In [20]:
df["Summary"]

0          Amit-Good
1     Sita-Excellent
2        Raj-Average
3    Priya-Excellent
4        Vikram-Good
5     Anjali-Average
6         Rohan-Good
7         Kiran-Poor
8    Meera-Excellent
Name: Summary, dtype: object

In [21]:
df

     Name  Age  Salary Performance          Summary
0    Amit   25   50000        Good        Amit-Good
1    Sita   30   60000   Excellent   Sita-Excellent
2     Raj   28   55000     Average      Raj-Average
3   Priya   35   75000   Excellent  Priya-Excellent
4  Vikram   40   80000        Good      Vikram-Good
5  Anjali   29   52000     Average   Anjali-Average
6   Rohan   32   70000        Good       Rohan-Good
7   Kiran   26   48000        Poor       Kiran-Poor
8   Meera   31   65000   Excellent  Meera-Excellent